app/controllers/api/v1/fruits_controller.rb

  def index
    render json: Fruit.all
---
SELECT "fruits".* FROM "fruits"