app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 75], ["LIMIT", 1]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at", "quantity") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["product_id", 75], ["cart_id", 58], ["created_at", "2018-06-23 02:31:35.547234"], ["updated_at", "2018-06-23 02:31:35.547234"], ["quantity", 1]]
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save

DELETE FROM "line_items" WHERE "line_items"."id" = $1  [["id", 980190962]]
---
  def destroy
    @line_item.destroy

SELECT  "line_items".* FROM "line_items" WHERE "line_items"."id" = $1 LIMIT $2  [["id", 980190962], ["LIMIT", 1]]
---
    def set_line_item
      @line_item = LineItem.find(params[:id])