app/controllers/products_controller.rb

  def index
    products = Product.all
---
SELECT "products".* FROM "products"

  def show
    product = Product.find(params[:id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 75], ["LIMIT", 1]]

  def create
    product = Product.new(product_params)

    respond_to do |format|
      if product.save
---
INSERT INTO "products" ("title", "description", "image_url", "price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "title" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["title", "ruby"], ["updated_at", "2018-10-08 02:24:54.661247"], ["id", 5]]